eclipse-archived/kiso/config/thirdparty/stm32cubef7/stm32f7xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32f7xx_hal_conf.h
  * @author  MCD Application Team
  * @brief   HAL configuration template file. 
  *          This file should be copied to the application folder and renamed
  *          to stm32f7xx_hal_conf.h.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F7xx_HAL_CONF_H
#define __STM32F7xx_HAL_CONF_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* **************************************************************************************************************************************************************** */
/* 1. Module Selection                                                                                                                                              */
/* **************************************************************************************************************************************************************** */
/* This is the list of modules to be used in the HAL driver */
#define HAL_ADC_MODULE_ENABLED    ///<@details Macro to configure ADC module support. The module support is enabled for the project
#define HAL_CORTEX_MODULE_ENABLED ///<@details Macro to configure Cortex module support. The module support is enabled for the project
#define HAL_DMA_MODULE_ENABLED    ///<@details Macro to configure DMA module support. The module support is enabled for the project
#define HAL_FLASH_MODULE_ENABLED  ///<@details Macro to configure Flash module support. The module support is enabled for the project
#define HAL_GPIO_MODULE_ENABLED   ///<@details Macro to configure GPIO module support. The module support is enabled for the project
#define HAL_I2C_MODULE_ENABLED    ///<@details Macro to configure I2C module support. The module support is enabled for the project
#define HAL_IWDG_MODULE_ENABLED   ///<@details Macro to configure IWDG module support. The module support is enabled for the project
#define HAL_MODULE_ENABLED        ///<@details Macro to configure HAL module support. The module support is enabled for the project
#define HAL_PWR_MODULE_ENABLED    ///<@details Macro to configure PWR module support. The module support is enabled for the project
#define HAL_RCC_MODULE_ENABLED    ///<@details Macro to configure RCC module support. The module support is enabled for the project
#define HAL_RTC_MODULE_ENABLED    ///<@details Macro to configure RTC module support. The module support is enabled for the project
#define HAL_SPI_MODULE_ENABLED    ///<@details Macro to configure SPI module support. The module support is enabled for the project
#define HAL_TIM_MODULE_ENABLED    ///<@details Macro to configure Timer module support. The module support is enabled for the project
#define HAL_LPTIM_MODULE_ENABLED  ///<@details Macro to configure LPTimer module support. The module support is enabled for the project
#define HAL_CRC_MODULE_ENABLED    ///<@details Macro to configure CRC module support. The module support is enabled for the project
#define HAL_UART_MODULE_ENABLED   ///<@details Macro to configure UART module support. The module support is enabled for the project
#define HAL_ETH_MODULE_ENABLED
#define HAL_WWDG_MODULE_ENABLED

    //#define HAL_CAN_LEGACY_MODULE_ENABLED
    //#define HAL_CAN_MODULE_ENABLED
    //#define HAL_CEC_MODULE_ENABLED
    //#define HAL_CRC_MODULE_ENABLED
    //#define HAL_CRYP_MODULE_ENABLED
    //#define HAL_DAC_MODULE_ENABLED
    //#define HAL_DCMI_MODULE_ENABLED
    //#define HAL_DFSDM_MODULE_ENABLED
    //#define HAL_DMA2D_MODULE_ENABLED
    //#define HAL_DSI_MODULE_ENABLED
    //#define HAL_ETH_MODULE_ENABLED
    //#define HAL_HASH_MODULE_ENABLED
    //#define HAL_HCD_MODULE_ENABLED
    //#define HAL_I2S_MODULE_ENABLED
    //#define HAL_IRDA_MODULE_ENABLED
    //#define HAL_JPEG_MODULE_ENABLED
    //#define HAL_LPTIM_MODULE_ENABLED
    //#define HAL_LTDC_MODULE_ENABLED
    //#define HAL_MDIOS_MODULE_ENABLED
    //#define HAL_MMC_MODULE_ENABLED
    //#define HAL_NAND_MODULE_ENABLED
    //#define HAL_NOR_MODULE_ENABLED
    //#define HAL_PCD_MODULE_ENABLED
    //#define HAL_QSPI_MODULE_ENABLED
    //#define HAL_RNG_MODULE_ENABLED
    //#define HAL_SAI_MODULE_ENABLED
    //#define HAL_SD_MODULE_ENABLED
    //#define HAL_SDRAM_MODULE_ENABLED
    //#define HAL_SMARTCARD_MODULE_ENABLED
    //#define HAL_SMBUS_MODULE_ENABLED
    //#define HAL_SPDIFRX_MODULE_ENABLED
    //#define HAL_SRAM_MODULE_ENABLED
    //#define HAL_UART_MODULE_ENABLED
    //#define HAL_USART_MODULE_ENABLED
    //#define HAL_WWDG_MODULE_ENABLED
/* **************************************************************************************************************************************************************** */
/* 2. HSE/HSI Values adaptation                                                                                                                                     */
/* **************************************************************************************************************************************************************** */
#if !defined(HSE_VALUE)
    /**
  * @brief   Value of the External oscillator in Hz
  * @details Adjust the value of External High Speed oscillator (HSE) used in your application.
  *          This value is used by the RCC HAL module to compute the system frequency
  *          (when HSE is used as system clock source, directly or through the PLL).
  */
#define HSE_VALUE 8000000U
#endif /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
    /**
  * @details Time out for HSE start up, in ms
  * */
#define HSE_STARTUP_TIMEOUT 100U
#endif /* HSE_STARTUP_TIMEOUT */

#if !defined(HSI_VALUE)
    /**
  * @brief   Value of the Internal oscillator in Hz
  * @details Internal High Speed oscillator (HSI) value.
  *          This value is used by the RCC HAL module to compute the system frequency
  *          (when HSI is used as system clock source, directly or through the PLL).
  */
#define HSI_VALUE 16000000U
#endif /* HSI_VALUE */

#if !defined(LSI_VALUE)
/**
  * @brief    LSI Typical Value in Hz
  * @details  Internal Low Speed oscillator (LSI) value.Value of the Internal Low Speed oscillator in Hz.
  *           The real value may vary depending on the variations in voltage and temperature
  */
#define LSI_VALUE 32000U
#endif /* LSI_VALUE */

