eclipse-archived/kiso/config/thirdparty/stm32cubef7/stm32f7xx_hal_conf.h
#if !defined(LSE_VALUE)
/**
  * @details  Value of the External Low Speed oscillator in Hz
  */
#define LSE_VALUE 32768U
#endif /* LSE_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
    /**
  * @details  Time out for LSE start up, in ms
  */
#define LSE_STARTUP_TIMEOUT 5000U
#endif /* LSE_STARTUP_TIMEOUT */

#if !defined(EXTERNAL_CLOCK_VALUE)
    /**
  * @brief   Value of the Internal oscillator in Hz
  * @details External clock source for I2S peripheral
  *          This value is used by the I2S HAL module to compute the I2S clock source
  *          frequency, this source is inserted directly through I2S_CKIN pad.
  * @note    To avoid modifying this file each time you need to use different HSE,
  *          we you can define the HSE value in your toolchain compiler preprocessor
  */
#define EXTERNAL_CLOCK_VALUE 12288000U
#endif /* EXTERNAL_CLOCK_VALUE */

/* **************************************************************************************************************************************************************** */
/* 3. System Configuration                                                                                                                                          */
/* **************************************************************************************************************************************************************** */
#define VDD_VALUE ((uint32_t)3300U)      ///<@details Value of VDD in mv
#define TICK_INT_PRIORITY ((uint32_t)0U) ///<@details tick interrupt priority
#define USE_RTOS 0U                      ///<@details To enable RTOS support
#define PREFETCH_ENABLE 1U               ///<@details To enable prefetch
#define ART_ACCLERATOR_ENABLE 1U         ///<@details To enable ART Accelerator
/* **************************************************************************************************************************************************************** */
/* 4. Assert Selection                                                                                                                                              */
/* **************************************************************************************************************************************************************** */
//#define USE_FULL_ASSERT               1U                      ///<@details To enable assertion support in the HAL drivers
/* **************************************************************************************************************************************************************** */
/* 4. Peripheral configuration                                                                                                                                      */
/* **************************************************************************************************************************************************************** */
/*  4.1 Ethernet configuration                                                                                                                                      */
/* **************************************************************************************************************************************************************** */
/*      4.1.1 General configuration                                                                                                                                 */
/* **************************************************************************************************************************************************************** */
/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0 2U
#define MAC_ADDR1 0U
#define MAC_ADDR2 0U
#define MAC_ADDR3 0U
#define MAC_ADDR4 0U
#define MAC_ADDR5 0U
/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE ETH_MAX_PACKET_SIZE ///<@details buffer size for receive
#define ETH_TX_BUF_SIZE ETH_MAX_PACKET_SIZE ///<@details buffer size for transmit
#define ETH_RXBUFNB 4U                      ///<@details Rx buffers of size ETH_RX_BUF_SIZE
#define ETH_TXBUFNB 4U                      ///<@details Tx buffers of size ETH_TX_BUF_SIZE
/* **************************************************************************************************************************************************************** */
/*      4.1.2 PHY configuration section                                                                                                                             */
/* **************************************************************************************************************************************************************** */
#define DP83848_PHY_ADDRESS 0x01U ///<@details DP83848 PHY Address
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_RESET_DELAY 0x000000FFU
#define PHY_CONFIG_DELAY 0x00000FFFU ///<@details PHY Configuration delay
#define PHY_READ_TO 0x0000FFFFU
#define PHY_WRITE_TO 0x0000FFFFU
/* **************************************************************************************************************************************************************** */
/*      4.1.3 Common PHY Registers                                                                                                                                  */
/* **************************************************************************************************************************************************************** */
#define PHY_BCR ((uint16_t)0x00U)                       ///<@details Transceiver Basic Control Register
#define PHY_BSR ((uint16_t)0x01U)                       ///<@details Transceiver Basic Status Register
#define PHY_RESET ((uint16_t)0x8000U)                   ///<@details PHY Reset
#define PHY_LOOPBACK ((uint16_t)0x4000U)                ///<@details Select loop-back mode
#define PHY_FULLDUPLEX_100M ((uint16_t)0x2100U)         ///<@details Set the full-duplex mode at 100 Mb/s
#define PHY_HALFDUPLEX_100M ((uint16_t)0x2000U)         ///<@details Set the half-duplex mode at 100 Mb/s
#define PHY_FULLDUPLEX_10M ((uint16_t)0x0100U)          ///<@details Set the full-duplex mode at 10 Mb/s
#define PHY_HALFDUPLEX_10M ((uint16_t)0x0000U)          ///<@details Set the half-duplex mode at 10 Mb/s
#define PHY_AUTONEGOTIATION ((uint16_t)0x1000U)         ///<@details Enable auto-negotiation function
#define PHY_RESTART_AUTONEGOTIATION ((uint16_t)0x0200U) ///<@details Restart auto-negotiation function
#define PHY_POWERDOWN ((uint16_t)0x0800U)               ///<@details Select the power down mode
#define PHY_ISOLATE ((uint16_t)0x0400U)                 ///<@details Isolate PHY from MII
#define PHY_AUTONEGO_COMPLETE ((uint16_t)0x0020U)       ///<@details Auto-Negotiation process completed
#define PHY_LINKED_STATUS ((uint16_t)0x0004U)           ///<@details Valid link established
#define PHY_JABBER_DETECTION ((uint16_t)0x0002U)        ///<@details Jabber condition detected
/* **************************************************************************************************************************************************************** */
/*      4.1.4 Extended PHY Registers                                                                                                                                */
/* **************************************************************************************************************************************************************** */
#define PHY_SR ((uint16_t)0x10U)                 ///<@details PHY status register Offset
#define PHY_MICR ((uint16_t)0x11U)               ///<@details MII Interrupt Control Register
#define PHY_MISR ((uint16_t)0x12U)               ///<@details MII Interrupt Status and Misc. Control Register
#define PHY_LINK_STATUS ((uint16_t)0x0001U)      ///<@details PHY Link mask
#define PHY_SPEED_STATUS ((uint16_t)0x0002U)     ///<@details PHY Speed mask
#define PHY_DUPLEX_STATUS ((uint16_t)0x0004U)    ///<@details PHY Duplex mask
#define PHY_MICR_INT_EN ((uint16_t)0x0002U)      ///<@details PHY Enable interrupts
#define PHY_MICR_INT_OE ((uint16_t)0x0001U)      ///<@details PHY Enable output interrupt events
#define PHY_MISR_LINK_INT_EN ((uint16_t)0x0020U) ///<@details Enable Interrupt on change of link status
#define PHY_LINK_INTERRUPT ((uint16_t)0x2000U)   ///<@details PHY link status interrupt mask
/* **************************************************************************************************************************************************************** */
/*  4.2 SPI configuration                                                                                                                                           */
/* **************************************************************************************************************************************************************** */
/* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver, Activated: CRC code is present inside driver, Deactivated: CRC code cleaned from driver */
#define USE_SPI_CRC 1U ///<@details Macro to activate CRC feature inside HAL SPI Driver
/* **************************************************************************************************************************************************************** */
/*  4.3 TIM configuration                                                                                                                                           */
/* **************************************************************************************************************************************************************** */
/* REGISTER USE_HAL_TIM_REGISTER_CALLBACKS: Use to enable the use of user defined timer callbacks so that we can use separate callback functions for different
 * peripherals associated with the timer */
#define USE_HAL_TIM_REGISTER_CALLBACKS 1U ///<@details The macro to enable the use of user defined timer callbacks. Should be defined as 1 to enable
/* **************************************************************************************************************************************************************** */
/*  5 Includes                                                                                                                                                      */
/* **************************************************************************************************************************************************************** */
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32f7xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32f7xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32f7xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

